[{"title":"Walk the walk and you will receive your unique Chan “gift.”","content":"I was born with a congenital hip dislocation on my left side, so when I started to sit, it was challenging for me to do even half lotus. My Chan teacher, Venerable XX, was very careful to not push me too hard. All she asked was that I sit a little bit longer every day. And so, that’s what I did. Starting with half lotus, I worked to distract myself so as not to unbuckle. Watching YouTube, listening to music, talking to friends … you name it, I tried it. And ever so slowly I was able to push my half lotus from ten minutes to almost an hour, just by adding a half to full minute every day. I started to sit because I have a very stressful job in a hospital. Since Covid, the stress only got worse. I tried guided meditation but stopped making progress in a very short time. After a trusted friend told me about Chan, I decided to give it a try. The pain was unexpected. But if I was to really get anything from it, I was going to have to give it my all. Initially, I couldn’t understand Master’s talks. Yes, he was funny, but I truly had no idea what he was talking about. I knew nothing about Buddhism prior to this. Then one day, struggling with pain, nothing that had helped before was working. Desperate, I found a video of Master and suddenly, I got it! I understood every word he said. “Enduring the pain builds blessings,” he said. “To make progress, you must not quit!”And just like that, by not quitting, I made progress. I was able to sit in full lotus after just a couple of months. After practicing Chan Buddhism for one and a half years, my new record is four hours!Does it still hurt? Oh, yes. It hurts like hell. Yet I was able to experience extreme blissfulness after the extreme pain. When I felt I was at my breaking point, unable to continue, BOOM!, the pendulum swung the opposite direction. Plus my energy/ focus/ emotions/ recovery time are the best they’ve ever been in my whole, entire life. But don’t take my word for it, try it! Check it out. Walk the walk and you will receive your unique Chan “gift.”​-F.L."},{"title":"Wei Tou Bodhisattva","content":"“I would like to share a story, an experience I had relating to Wei Tou Bodhisattva.One day, a long time ago, I was sitting on the floor reading, 42 Chapters Sutra, explained by Master YongHua. My back began to hurt so I laid down to rest on the floor for a few minutes. I opened the book to cover my eyes and after a few minutes, I dozed off. Then, I had a strange and terrible dream. I saw a man wearing an ancient style of clothing and holding a pestle in his hand. He was furious at me, and began to chase me. His scowl was stern, severe. Referring to the book being used to cover my eyes, he admonished me. “How dare you treat the Sutra like that?” Awakened by his terrible anger, I sat bolt upright. The book fell from my face, opening to an image of Wei Tou Bodhisattva. The image matched exactly as he had appeared to me in my dream. The face, the clothes he wore, the pestle, everything. I had no doubt then, or now, that I had been visited by Wei Tou. I vowed to never disrespect any sacred object again.”​Shared by Kenix"},{"title":"Emily's Cultivation Story","content":"“I was planning a trip to California, to visit friends, but also with a mission to visit a Buddhist temple. I sent a message out within my heart and mind asking for help to find a true temple, one with a real Shifu to teach and guide me. I did a search in a Yelp App. The first one listed was Lu Mountain Temple. I felt a deep connection to the name, so I thought to myself, “Okay, let’s go there.” When I went, I told one of the Venerables about finding them on Yelp. She told me that it was fate that brought me there as they don’t advertise on Yelp.While there, I relayed a story about an experience I had at a friend’s banquet. It was a big celebration with much feasting. My brother passed me a huge plate full of filet mignon. Up till then I’d always enjoyed eating meat. Suddenly I saw a face of a black cow crying and mooing at me. I froze. My heart ached and I felt a lump in my throat. My brother kept calling to me, as if from a distance. I snapped out of my vision and shook my head no, I don’t want it. Venerable told me it was the Compassion Mantra towards lower beings (animals and insects) revealing itself to me. I learned from one of the lay disciples at the temple that in order to be a Buddhist I need to seek refuge.I’d always thought I was a Buddhist. My parents and relatives were Buddhists, weren’t they? After all, we burnt incense to the Buddhas and Bodhisattvas every 1st and 15th of the Lunar Calendar. We made ceremonial food offerings to the deities every Lunar Year; offerings of “dead money,” displays of fruits, even cooked meats! (Actually a Taoist belief, I later learned.)Lu Mountain Temple brought me to the Chan Teaching of sitting in lotus. As a child, I easily sat in lotus. It was easy and fun! When a Venerable asked a group of us beginners to sit in lotus, I was still able to. But it was definitely not as comfortable or easy as when I was a child. (Here’s a little secret. When I was little, I told my parents I wanted to be a monk and asked them to send me to the Shaolin Temple in China. I was broken-hearted when my dad told me no girls were allowed.) Venerable taught us to sit in the Chan way, to endure the pain, with a goal to reach an hour, one step at a time, adding five minutes each day.When I returned home to Chicago, I continued to sit in full lotus while reciting the mantras I’d learned. Initially, I was only able to cross my legs for 10-15 minutes before unbuckling. But with determination, I pushed further, to 30 minutes, 45 minutes, before achieving an hour. I bowed in repentance, sitting longer, increasing exponentially as time went by, while attending every Fo Qi and Chan Qi I could. The more afflicted I was, the more difficult the level of pain.My job is very stressful, with last-minute deadlines, constant interruptions. Daily, I deal with many types of personalities, people in trouble, people riding an emotional roller coaster of problems. My patience and afflictions are constantly being tested.In almost seven years as a Buddhist disciple practicing Chan I have noticed a huge difference in my life from before and now. Whenever I feel a cold coming on, all I have to do is sit in lotus. Minor colds are instantly dispelled when I focus on my Dan-Tian. Stronger viral flus take longer, up to three hours. The Omicron took even longer, but eventually I learned to repel even stronger strains of variants. Sitting continues to keep me safe and healthy through even the toughest of bugs threatening to invade me.Here are some other perks from practicing Chan Buddhism.- I am much better at letting things “go.” It gets easier and easier with time.- I feel calmer, a sense of contentment for no reason at all.- I’m able to function better, feel sharper, in even the most stressful situations.- I’ve developed more patience, which has always been my biggest obstacle to overcome.- I have learned, through my own experiences, how to sincerely ask the Buddhas for help when it is most needed.​In closing, I can only wish for you the very same gifts bestowed upon me in my continuing studies. I hope you will take the opportunity to enter into a practice of your own. The benefits are without limit.”"},{"title":"The transformation of the mind and body from sitting in full lotus for over one hour. Billy Tiet’s experience.","content":"Billy Tiet is a regular volunteer at Lu Mountain Temple and Wei Mountain Temple. He started to come to the temple regularly since two years ago. He is a heavy smoker and he is his only own boss. Nobody can tell him what to do. He often fires his own boss at work and he is very proud of himself doing so. But because of his bad temper, his life has not been easy.         He is a single dad. Since he separated from his wife, his younger daughter chose to stay with her dad. He was always worried how to support his young daughter. Since he can’t hold his job for a long time, he constantly had to struggle to look for a new job and pay the bills.His health was bad too. He smokes cigarettes heavily and didn’t eat much. He was skinny and had back pain too. He also had heart problem. He always felt so tired and not motivated to work hard at his job.He once stopped by Lu mountain temple many years ago. When he was troubling for his life and his health was getting worse, he remembered the temple. He decided to visit the temple again about 2 years ago. When he first started coming to Lu Mountain Temple more often, he wasn’t really putting much efforts to sit in full lotus. He only listens to Dharma talks and cleaned around the kitchen, washed the dishes and helped around whenever he had chance.         Billy started sitting in meditation for 10~20 minutes only and listened to Master’s dharma talks. It already helped him a lot. He was able to worry less and his health was getting much better just being around temple more often. He continued to help around when we started to do more activities at Wei Mountain Temple too.One day, he walked into the Buddha Hall before the lunch time. Like he always did, he bowed three times to the Buddha. One of the nuns shouted at him, “You come back here, and sit!”. This was out of his expectation. He didn’t have chance to think or say no. “oh okay.. let me go and bow to Master Hsuan Hua’s altar too. I will come back”.So he came back to Buddha hall. He sat in full lotus. The nun asked “how long can you sit? What’s the longest time you sat in full lotus?”. Billy said “10 minutes .. maybe 15 minutes”The nun firmly said “okay from now on, you don’t unbuckle, you hear me? I will do the lunch offering and I will be back. You don’t unbuckle until I say so. okay?”. Billy replied “okay”The nun finished the offerings and sat right next to him. He already sat for about 20 minutes. Billy started complaining about the pain. “I am sweating. I can’t do any longer, Something is poking my heart!” The nun says “is that so? it’s normal. just sit. don’t unbuckle”After another 10 minutes, Billy said “my arms are feeling numb. I can’t move.. my back hurts”. The nun says “oh is that so? that’s normal. Keep sitting. You don’t unbuckle until I say so”He really was in pain. But the nun wouldn’t turn her head. She was staring at him the entire time. The nun told him “Do you love your daughter? How old are you now?”, “I am 48 years old”, “Your daughter is still young. Don’t you want to get better and stay healthy until your daughter grows up?” and he said “yes of course I do”, “well then you have to sit. You have to learn to get better. you hurt so much because your body is sick”         The nun continued “It’s already lunch time. You know I don’t have dinner so I am very hungry so you should be grateful that I decided to stay and watch you. I am still here to help you so you better not unbuckle. You are almost done so just endure!”When he sat for one hour, suddenly his face looked brighter. He was calmer and better. The nun said “okay now you can unbuckle. Do it very slowly and make sure that your legs feel normal before you walk downstairs so you don’t fall”​Billy was a different person after the sitting. The next day Billy came back to the temple and told us “I feel different. My body feels stronger. Legs were sore for a while but I had so much more energy. I wasn't tired at work anymore, I was motivated to work harder the next day after the one hour sitting.”Billy said that he was feeling more energetic every day ever since the one hour sitting. Even when he can sleep less hours at night, he wasn’t feeling tired or sleepy the next day. He is much happier and his mood is better. He always felt that his problems are not from him. They are all from other people. But from that day of sitting in much pain, he doesn’t care as much when people give him problems. His temper got better and he feels much more at ease.​Billy came back to the Buddha hall and sat for over one hour and fifteen minutes the next day. His daughter says she is proud of her daddy!"},{"title":"A message from a Korean cultivator","content":"​Written by Ven. XianAnWhen we visited Korea in early 2019, we met a monk, Seok-Du Sunim, at BongEunSa. BongEunSa is one of the biggest temples in Seoul city. After the retreat ended, I (at that time, Shana) visited BongEunSa again to help with English translation for their temple introduction catalogue.         Seok-Su Sunim called a laywoman who practices vigorously and introduced her to me. He and I encouraged her to learn how to sit in full lotus. After that, she contacted me through Messenger and began a daily practice of sitting in full lotus.​She blamed herself for not being able to concentrate well when she meditated. She had been instructed to do Hua-tou by a Korean master but was having much difficulty. I explained to her that not being able to concentrate was normal because she didn’t have the proper foundation.         It was challenging because she was in so much pain. She had not broken through the pain barrier even when sitting for over an hour and a half in full lotus, but she wasn’t giving up. She kept practicing and followed the instructions. She endured and endured.Last night she texted me that she had finally sat for 2 hours. She said, “The pain is too much. It’s unbearable, but in this extreme pain, for some reason my mind is more clear.” She practices at BongEunSa Seon Center, but their sitting duration is only 50 minutes. I encouraged her to continue to sit through their normal break time, which she was able to accomplish, with a lot of tears and sweat.​She can feel her concentration has improved, and her mind is much more clear than before. I understand that this was not easy without our support in person. She is strong and determined to cultivate!"},{"title":"Cultivator’s Diary from Korea: Seon-Mi Lee 수행자의일기: 이선미 (English / Korean)","content":"수행자의일기: 이선미 Cultivator’s Diary: Seon-Mi Lee11월30일달마톡을듣고 November 30, 2019. After listening to Master’s Dharma talk:​불칠수행마지막법문시간이었다.불칠수행의경험담을나눠주세요.하시자여러사람이감사의인사를하고또수행의고통만을경험하신분도있기도하였다.그중한국에서오신불자님께서예전에영화선사께서3시간반내어주신숙제를해내셨고그다음단계는무엇을해야하는지여쭙기위하여이번불칠에참석하였다고하셨다.오! 3시간반.나도열심히수행하여3시간반앉는것이익숙해지게되어영화선사를뵙고싶은서원이더확고해졌다.나도언젠가미국행비행기를타고불자님처럼영화선사께다음단계수행을여쭈러가야겠다.It was the last Dharma talk of the FoQi Buddha’s name recitation retreat. When Master said, “Please share your FoQi experience,” many people shared their gratitude. Someone said that it was just a lot of suffering, but there was one Korean cultivator who said that she received homework from Master back in April to sit for 3 1/2 hours. She came to FoQi so she could ask about what is next.Wow, 3 1/2 hours.I also want to work hard and get used to sitting for 3 1/2 hours. My vow to meet Master after being able to sit for 3 1/2 hours comfortably has become firmer. One day I want to take an airplane and go to the USA to meet Master so that I can ask what I need to do next.         12월1일 December 1결가부좌수행1시간57분Full lotus sitting: 1 hour and 57 minutes호흡관1시간Breathing: 1 hour능엄신주만트라30분Shurangama Mantra: 30 minutes아미타불염불12분Amitabha’s name recitation: 12 minutes능엄신주독송10분Shurangama Mantra: 10 minutes오늘은 어제의 아쉬움을 만회하고자1시간50분 알람을 맞춰놓고 시작했다. (어제3시좀전에식사를마쳤는데 이후부터 꽁깍지차만 두 컵정도 마시고 오후불식을 해보았다.)1시간25분 즘 넘어가며 다리부터 떨리기 시작했다.Today I wanted to do better than yesterday, so I set the alarm for 1 hour and 50 minutes. (Yesterday I finished my meal around 3:00 p.m. and drank two cups of tea only). My legs started to shake after 1 hour and 25 minutes.어깨가뻐근해지며두손을모은손과어깨가흔들렀다.종을들고있으면무당이굿하는소리가나겠다싶을만큼제대로(?)흔들려조금무서웠다.My shoulders started to feel sore. I put my palms together, and my palms and shoulders started to shake a little. If I was holding the shaman’s bell, the bell would really shake and make sound. I felt a little scared.현안스님이떨리면무서워하시말고떨리는대로두세요.선화상인께서우치(어리석음)가떨어져나가는거라말씀하시기도했어요.라해주신말을상기하며능엄신주만트라에집중했다.약5분간떨더니팔의떨림은저절로가라앉았고잠시후손과머리가한차례짧게흔들리더니가라앉았다.Venerable XianAn already told me that there’s no need to feel afraid and that I should let the shaking happen. Master HsuanHua said that shaking helps shake off the stupidity. While I reminded myself what Venerable XianAn told me, I continued to concentrate on the Shurangama Mantra recitation. After 5 minutes, the shaking of my arms calmed down. Not long after, my hands and head also calmed down.시간이지날수록그동안괴로웠던오른쪽발과골반통은없으나왼쪽발이많이아팠다.어제부터불식을하며다짐했던것을상기하니좀더참을수가있었다.어릴때부터자주삐고많이걸으면으례히탈이나던왼발이라통증이시작될때올것이왔구나싶었다.통증은심했으나정신은점점맑아지는것같았고잡념도줄어들었다.오직발목통증만견디면더앉을수있을것같아계획한시간보다7분더하고마쳤다.As the time passed, the pain in the right foot and hip went down, but my left foot was hurting a lot. Because I had fasted since yesterday and resolved to sit longer, I was able to bear this pain longer. Since my left foot has had many problems since childhood, when the pain started there, it was expected. The pain was increasing, but my head was more and more clear and my excessive thoughts were reduced. I felt that I could sit longer if I could bear the left foot pain. I was able to push 7 minutes longer than my original plan.​오늘은부모님생각이많이났다.오직현실에서아등바등고생하시며성실히살아오신어머니아버지남은여생그성실과인내로스스로복짓는삶되도록열어주시기를수행하며빌었다.나무아미타불관세음보살()Today I thought of my parents. I prayed for them to be able to accrue more blessings for the rest of their lives because they have struggled to survive. Na Mo Amitabul Gwan Sae Um Bo Sal (This is Korean pronunciation of Na Mo Emitofou Guanyin Pu Sa)"},{"title":"Liz’s experience of Chan meditation since 2016. How it changed her life and people around her (overcoming depression)","content":"My name is Lizbeth, I'm 38 years old, and I'm Native American from the Yaqui tribe. My mother was born in Sacramento and she's Yaqui and Norwegian and my father is a US citizen born in Mexico, he's descended from Spanish and Huichol (an Indigenous tribe native). He and my mom separated when I was a child. I have a 16 year old son named Takoda and he meditates too.         The difficulties I was trying to overcome, initially, was depression. At that time I was going through a divorce. My mom has bipolar depression and my little sister is handicapped and she was trying to fight us all the time and I take care of both of them. My son is a kind and understanding person but even he was being affected by all that was going on and he was getting lower grades in school. His teachers praised his good manners they just wished he applied himself more to his studies. I was having great difficulties with getting my thoughts and emotional reactions under control. I would cry when I was alone in my car. I didn't like being short tempered and sometimes I was not sleeping (insomnia) or sleeping too much, taking too many naps and feeling fatigue. I had a knee injury and and low back pain. I was overall unhappy with my life.​I started Chan meditation in 2016. I was walking in the park with my son and saw someone was putting a sign, ‘Chan Meditation in the Park’. I asked how much she would charge for the class. She said “it’s free.”. That’s how everything started!         At first, when I began sitting in full lotus and meditating on Amituofo, I felt the healing in my body. My knee healed up quickly and my lower back didn't hurt as much. A few months later I was sitting for an hour, daily, and I was feeling well rested. Soon my insomnia was gone and I was getting a full night’s sleep. I also didn't need as much sleep to feel well rested. Little by little I began to notice my thoughts were more focused and I wasn't angry or depressed, I was able to think clearly. I no longer react quickly in response to other people’s actions. I'm more patient and tolerant of everyone including myself. My little sister is calmer around me and is easily made peaceful. She doesn't try to fight with me anymore. My mom's bipolar depression isn't as bad as it used to be and she's more open to taking advice from me about her own health. Even my son’s grades in school have improved. I'm more supportive of him and he started meditating too.My spirituality comes from Native American Traditions. It's not a religion but a way of life. It's very inclusive and tolerant of other people’s faith. I relate many of the spiritual leaders from the past as Holy men and women who were born to teach us something and it is up to us to pick up those teachings and utilize them or not. I choose to utilize Chan as part of my self-care and actually helps me improve the way I take care of others.​Chan mediation helped me improve on so many levels but if I were to choose one thing that it helped me the most with, it would be, with my mind, and the ability to organize my thoughts. I no longer feel so scattered about my choices and decisions. I enrolled in college and got accepted into the Honors Program. I no longer worry about living up to other people’s expectations of me. I see clearly where I've wasted so much time on worrying about things that will most likely never happen. And I'm enjoying life's precious moments on a deeper level than before."},{"title":"Juan’s experience in Chan Meditation. Life transformation!","content":"​Written by Venerable XianAn, Wei Mountain Temple​I remember when I first started seeing Juan at Lu Mountain Temple about 2 years ago. Back then I was so busy, I wasn’t able to talk with him much, but I remember that he always worked around the temple even during lunchtime while everyone else was enjoying the food. One day I asked him, “Why don’t you come and join the lunch with everyone?” He said, “I don’t want to spend my blessings. I want to work and help the temple.”​Unlike me, Juan always worked hard at the temple and then quietly went back home. He did that regularly, maybe once or twice a week. He politely refused to have lunch and continued to work.​Today I saw him sitting in full lotus during Master YongHua’s sutra lecture. He didn’t move or make any sound for the entire 2 hours, and his face looked peaceful. I wanted to find out how cultivation has changed his life, so I invited him to have a conversation.​Juan was born in 1981 in Guadalajara, Mexico, and his family moved to the U.S. when he was only 8 years old. He is a vocational nurse, has been married for 11 years, and has no children. He grew up in a typical Mexican family going to Catholic church. Until he turned 17 years old, he went to church every weekend with his family.​However, he had been very self-destructive in his 20’s. He wore his hair long like a rock musician, with large tattoos on his body, and he often drank alcohol and smoked. He spent his time hanging out with friends at music concerts. Like a lot of young adults in the U.S., he did various kinds of drugs too.         He had no direction in his life but didn’t want to return to the Catholic church. He felt that the church didn’t provide any realistic solutions for his problems. There were also parts of the sermon with which he did not agree. Therefore, he decided to try Buddhist temples.He did some internet research and found a Japanese Buddhist church. He went to this church every week for a year, but he didn’t experience any realistic or practical changes in his life. There were no actual monks or meditation class. The church members were not observing precepts. They were eating meat, and they smoke and drank. He decided to stop going because he wanted to find a place that practiced more principles. About a year later, he learned about Lu Mountain Temple, saw some photos, and liked what he saw.​When Juan first visited Lu Mountain Temple, he was nervous. It was during the Chan Qi meditation retreat. He saw people were sitting in full lotus in the Buddha hall, so he naturally sat in full lotus too. He experienced intense pain but was able to sit for about 30 minutes that day. When he learned that Master Yonghua gave a daily Dharma talk in the evening, he decided to stay for the talk. He felt a strong connection with Master YongHua’s Dharma, and it made a strong impression on him when Master said that we can all become Buddha, regardless of who we are or where we come from.​He decided to help out around Lu Mountain Temple to generate more blessings as he had learned during the Dharma talk. His hope was that these blessings could help him transcend beyond worldly life.​Juan has meditated daily ever since, and within 3 months, he was able to sit for more than one hour. His life has drastically changed due to this daily meditation. He naturally stopped drinking, and the anger arising in his mind has significantly reduced. Just a few months of meditation and volunteering at the temple has brought him peace of mind! He has become a better son and brother.​Within 6 months, he officially became a Buddhist, took refuge under Master YongHua, and received the Five Precepts. Following this, his life changed even more. One of the biggest changes was that he started taking his cultivation seriously. Juan started sitting in full lotus for at least 2 hours every day. He was more aware of his environment and the people around him. He became a better nurse by having more patience while listening to his patients, by helping them be more comfortable and happy. His life had become more meaningful...but there was a drawback. Since he began caring for his patients with sincerity and a more open heart, his health had begun to decline. As a nurse, he had been engaging in meddling—interfering with the karmic debts of the sick people he was treating.He sought the counsel of Venerable Xian Jie and was told about the Medicine Master Dharma. Juan learned that he could improve his health, career, and cultivation by creating more Medicine blessings, so he requested a Medicine Master plaque. Amazingly, he didn’t feel sick quite as often, and his physical health significantly improved immediately. He also noticed that he was more mentally stable at his work.​Juan has even thought of leaving the home life. He is very grateful to Venerable Xian Jie for helping with his cultivation. Juan is just another example of how our temple community is very international, with a great mix of cultures. My hope is that he would attain fruition in his cultivation in the near future."},{"title":"A Silicon Valley Scientist, Aravind's FoQi Experience in FoQi, Buddha's Name Recitation Retreat at Wei Mountain Temple.","content":"​Aravind came to Wei Mountain Temple and stayed for one week to participate FoQi Buddha’s name recitation retreat. FoQi literally means “Buddha Seven” and this is a #PureLand Dharma door to recite #Amitabha Buddha’s name all day. FoQi schedule is very hard. It starts at 4am and participants attend ceremonies and Buddha's name recitation all day until 10pm.   FROM ARAVIND.My name is Aravind Natarajan (male, 41yr). I work as a data scientist at #Fitbit, which is a health and wellness tech company in San Francisco. I grew up in India, and came to the U.S. to pursue my doctorate in Physics, and then as a research scientist. I later got interested in data science, machine learning, and artificial intelligence, and came to the bay area.I got interested in Buddhism because I found Buddhist prayers to be peaceful, and I liked the message of non-violence, and compassion towards all living beings. In 2014, I volunteered as an English teacher for a short time at a Buddhist monastery in Ladakh (Ladakh is in India, but very close to Tibet), organized by the #Avalokitesvara Trust, and it was my first experience in a Buddhist environment. I later went to Japan on a research trip, and got the chance to visit Kamakura including the Hase Kannon temple and the famous Amida Daibutsu statue. Closer to home, in Ukiah, we have the large and beautiful City of Ten Thousand Buddhas with peacocks and deer. I found that I liked the chanting at CTTB and joined in when I could. I also like to attend the Saturday morning service at the Berkeley monastery.          When I started at Fitbit nearly 2 years ago, we had mindfulness classes at the company that I attended every week. They were pleasant, but I felt there was more to meditation, and started looking for a good book for beginners. That was how I found Master's Chan book which is an excellent resource for beginning students. I feel lucky to have met Master and his lay and monastic disciples at a #meetup event in San Francisco where Master spoke more about meditation and its ability to improve our physical and mental well-being, and to make us better human beings.I participated in a 3 day #Amitabha recitation retreat at the Berkeley Monastery during Vesak (#Shakyamuni Buddha's birthday) this year. Last year, I went to the 3 day Amitabha recitation retreat during Thanksgiving, also at the Berkeley #Monastery. CTTB organizes Guan Yin name recitation retreats three times a year, and I attended these sessions on Sundays and Saturdays. The #FoQi at Wei Mountain #Temple was the first time I participated in a 7 day retreat, and the first time I stayed at the temple during the retreat.​When the first day concluded, I was extremely tired and had to drag myself downstairs even to brush my teeth - I was wondering what I had signed up for, and how I could finish the week! I got used to the schedule after a couple of days. Interestingly, I found it easier as the week progressed. Towards the end, I found myself having much more energy than usual, even though I was eating less and sleeping a lot less! The #recitations and meditation sessions help us attain a peaceful state of mind. I benefited greatly from the retreat and encourage everyone to give it a try.         At Fitbit, I worked on a project to investigate how the heart rate, breathing, and skin conductance change during #mindfulness experiences. Here is a photo of me, meditating while being connected to a machine that measures these different bio-signals."}]